{
    "bio": {
        "name": "Kaike Ping",
        "pfp": "/pkk/images/avatar.png",
        "title": [
            "PhD Candidate",
            "Computer Science",
            "Virginia Tech"
        ],
        "email": "pkk@vt.edu",
        "linkedin": "https://www.linkedin.com/in/kaike-ping/",
        "github": "https://github.com/kaikeping",
        "scholar": "https://scholar.google.com/citations?user=Pcj0F-UAAAAJ&hl=en"
    },
    "about": {
        "content": "I am a PhD candidate in *Computer Science* at *Virginia Tech* since August 2022, advised by Prof. Eugenia Rho. I received my Master's degree in *Biostatistics* from Southern Medical University in Guangzhou, China in 2017, advised by Prof. Pingyan Chen. I am broadly interested in *natural language processing (NLP)* and *computational social science*, with a focus on *human-computer interaction (HCI)* in developing and evaluating an interactive AI system to assist people. I have also conducted research on epidemiology and public health, including pandemic surveillance, risk assessment, transmission modeling, and field investigations.",
        "techs": [
            {
                "name": "R",
                "icon": "skill-icons:r-dark",
                "description": "10+ years of experience"
            },
            {
                "name": "Python",
                "icon": "skill-icons:python-dark",
                "description": "10+ years of experience"
            },
            {
                "name": "PyTorch",
                "icon": "skill-icons:pytorch-dark",
                "description": "3+ years of experience"
            },
            {
                "name": "HuggingFace",
                "icon": "fluent-emoji-flat:hugging-face",
                "description": "2+ years of experience"
            },
            {
                "name": "SQL",
                "icon": "skill-icons:mysql-dark",
                "description": "5+ years of experience"
            },
            {
                "name": "PHP",
                "icon": "skill-icons:php-dark",
                "description": "The best programming language in the world!"
            },
            {
                "name": "JavaScript",
                "icon": "skill-icons:javascript",
                "description": "5+ years of experience"
            },
            {
                "name": "Vue",
                "icon": "skill-icons:vuejs-dark",
                "description": "1+ year of experience"
            }
        ]
    },
    "experience": [
        {
            "title": "PhD Candidate",
            "date": "Aug 2022 ➔ Present",
            "company": "Virginia Tech",
            "description": [
                "*Statistical Modeling (R)*: Led large-scale quantitative research on online user behavior, surveying 1,100+ participants and employing advanced statistical modeling in R (e.g., Structural Equation Modeling, Mixed-Effects Models) to analyze motivations and barriers related to social media counterspeech",
                "*Small-Sample NLP Evaluation*: Developed high-performance NLP models under limited data conditions, achieving ~87% predictive accuracy for counterspeech efficacy. This involved engineering and evaluating transformer-based models (e.g., RoBERTa) against state-of-the-art LLMs (GPT, Claude, Gemini) on a specialized dataset of 600+ curated text samples",
                "*Research Publication Impact*: Published key findings from this research in premier Human-Computer Interaction (HCI) academic venues, including ACM ToCHI (journal) and CSCW (conference)"
            ],
            "technologies": [
                "R", "Python", "NLP", "HuggingFace", "Statistical Modeling", "HCI Research"
            ],
            "icon": "school-outline"
        },
        {
            "title": "Assistant Research Fellow",
            "date": "Nov 2019 ➔ Jul 2022",
            "company": "Guizhou Center for Disease Control and Prevention",
            "description": [
                "*Early COVID-19 Research*: Pioneered early-phase COVID-19 epidemiological analysis, being among the first global researchers to estimate its incubation period using Accelerated Failure Time models and the effective reproduction number via the Wallinga & Teunis method",
                "*Workflow Engineering & Automation*: Engineered an automated R and SQL workflow for ingesting, cleaning, and transforming weekly surveillance data (3.8M pop.), culminating in the automated generation of epidemiological summaries with key public health metrics",
                "*Text Data Processing*: Enhanced data extraction capabilities by fine-tuning a compact NLP model (bert-small) to parse and quantify information from textual epidemiological reports, standardizing inputs for an Excel-based centralized data repository",
                "*Pandemic Risk Assessment*: Developed and validated an Autoregressive Distributed Lag (ARDL) model in R, leveraging 177 weeks of internet search trend data (correlating with 173K pediatric HFMD cases) to forecast incidence rates, integrated into the provincial early warning system"
            ],
            "technologies": [
                "R", "SQL", "Epidemiological Modeling", "NLP", "Survival Analysis", "Public Health"
            ],
            "icon": "earth-outline"
        },
        {
            "title": "Software Engineer",
            "date": "Jul 2017 ➔ Jun 2019",
            "company": "Contract Research Organization of CLT Inc",
            "description": [
                "*System Design & Development*: Led design and development as chief programmer for core clinical trial systems (Central Randomization & EDC), defining database architecture (MySQL), data validation rules, and system functionalities using PHP, JavaScript, HTML/CSS",
                "*Central Randomization System*: Engineered a web-based Central Randomization System deployed in 20+ multi-center clinical trials, featuring allocation concealment algorithms tailored to trial-specific statistical needs and enabling automated data export to SAS datasets",
                "*Electronic Data Capture System*: Developed a scalable Electronic Data Capture (EDC) SaaS platform managing clinical trial data for 100K+ patients, significantly improving real-time data access and data management efficiency for research teams"
            ],
            "technologies": [
                "PHP", "JavaScript", "MySQL", "HTML", "CSS", "SaaS"
            ],
            "icon": "business-outline"
        },
        {
            "title": "Research Intern",
            "date": "Nov 2015 ➔ Feb 2017",
            "company": "National Clinical Research Center for Kidney Disease",
            "description": [
                "*CRF Design & Data Standardization*: Contributed to a large-scale chronic kidney disease cohort study by co-designing Case Report Forms (CRFs), focusing on rigorous data standardization (defining variable formats, units, and ranges) to ensure high-quality data collection for subsequent statistical analysis"
            ],
            "technologies": [
                "Cohort Study", "Study Design", "Biostatistics", "Data Standardization"
            ],
            "icon": "medkit-outline"
        }
    ],
    "education": [
        {
            "title": "PhD Candidate in Computer Science",
            "date": "Aug 2022 ➔ Present",
            "university": "Virginia Tech"
        },
        {
            "title": "Master of Medicine in Biostatistics",
            "date": "Sep 2014 ➔ Jul 2017",
            "university": "Southern Medical University"
        },
        {
            "title": "Bachelor of Science in Applied Statistics",
            "date": "Sep 2010 ➔ Jul 2014",
            "university": "Southern Medical University"
        }
    ],
    "publication": [
        {
            "title": "Perceiving and countering hate: The role of identity in online responses",
            "venue": "CSCW '25",
            "authors": "Kaike Ping, James Hawdon, Eugenia H Rho",
            "pic": "/pkk/images/pub/chatgpt_vs_difficulty_ver2.1.png"
        },
        {
            "title": "Behind the Counter: Exploring Motivations and Barriers of Online Counterspeech Writing",
            "venue": "ACM Transactions on Computer-Human Interaction",
            "authors": "Kaike Ping, Anisha Kumar, Xiaohan Ding, Eugenia H Rho",
            "pic": "/pkk/images/pub/CROSS1Flowchart.png"
        },
        {
            "title": "Epidemiologic Characteristics of COVID-19 in Guizhou Province, China",
            "venue": "The Journal of Infection in Developing Countries",
            "authors": "Kaike Ping, Mingyu Lei, Yun Gou, Zhongfa Tao, Guanghai Yao, Can Hu, Qin Tao, Zhiting Zou, Dingming Wang, Shijun Li, and Yan Huang",
            "pic": "/pkk/images/pub/mscanojidc-015-0389.jpg"
        },
        {
            "title": "A multi-level benchmark for causal language understanding in social media discourse",
            "venue": "EMNLP '25",
            "authors": "Xiaohan Ding, Kaike Ping, Buse Çarık, Eugenia Rho",
            "pic": "/pkk/images/pub/ScreenShot_2026-02-26_193710_425.png"
        },
        {
            "title": "Designing Human-AI Collaboration to Support Learning in Counterspeech Writing",
            "venue": "2025 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC)",
            "authors": "Xiaohan Ding, Kaike Ping, Uma Sushmitha Gunturi, Buse Carik, Sophia Stil, Lance T Wilhelm, Taufiq Daryanto, James Hawdon, Sang Won Lee, Eugenia H Rho",
            "pic": "/pkk/images/pub/ScreenShot_2026-02-26_193827_966.png"
        },
        {
            "title": "Exploring large language models through a neurodivergent lens: use, challenges, community-driven workarounds, and concerns",
            "venue": "Proceedings of the ACM on Human-Computer Interaction",
            "authors": "Buse Carik, Kaike Ping, Xiaohan Ding, Eugenia H Rho",
            "pic": "/pkk/images/pub/Neurodivergent.png"
        },
        {
            "title": "BioDolphin as a comprehensive database of lipid–protein binding interactions",
            "venue": "Communications Chemistry",
            "authors": "Li-Yen Yang, Kaike Ping, Yunan Luo, Andrew C McShan",
            "pic": "/pkk/images/pub/ScreenShot_2026-02-26_194303_341.png"
        },
        {
            "title": "A New Preprocedure Risk Score for Predicting Contrast-Induced Acute Kidney Injury",
            "venue": "Canadian Journal of Cardiology",
            "authors": "Chongyang Duan, Yingshu Cao, Yong Liu, Lizhi Zhou, Kaike Ping, Ming T. Tan, Ning Tan, Jiyan Chen, and Pingyan Chen",
            "pic": "/pkk/images/pub/S0828282X17300302.jpg"
        },
        {
            "title": "Initial Clinical Characteristics of 146 Patients with COVID-19 Reported in Guizhou Province, China: A Survival Analysis",
            "venue": "The Journal of Infection in Developing Countries",
            "authors": "Yun Gou, Kaike Ping, Mingyu Lei, Chun Yu, Ying Tao, Can Hu, Zhongfa Tao, Zhiting Zou, Weijia Jiang, Shijun Li, Li Zhuang, Zhaobin Liu, and Yan Huang",
            "pic": "/pkk/images/pub/mscanojidc-016-0032.jpg"
        },
        {
            "title": "Crowdsourcing assessment of maternal blood multi-omics for predicting gestational age and preterm birth",
            "venue": "Cell Reports Medicine",
            "authors": "Adi L. Tarca, Bálint Ármin Pataki, Roberto Romero, The DREAM Preterm Birth Prediction Challenge Consortium (including Kaike Ping), et al.",
            "pic": "/pkk/images/pub/PIIS266637912100166X.jpg"
        },
        {
            "title": "Cervical Rotatory Manipulation Decreases Uniaxial Tensile Properties of Rabbit Atherosclerotic Internal Carotid Artery",
            "venue": "Evidence-Based Complementary and Alternative Medicine",
            "authors": "Shaoqun Zhang, Ji Qi, Lei Zhang, Chao Chen, Shubhro Mondal, Kaike Ping, Yili Chen, and Yikai Li",
            "pic": "/pkk/images/pub/5189356.fig.004a.png"
        }
    ]
}